versioduo/arduino-board-package/boards.txt
# USB vendor        0x6666
#
# Every product reserves 16 USB product IDs, which changes with the
# number of configured MIDI ports/cables.
#
# Hardware:
#   axis             0xd980
#   connect          0xd910
#   control          0xd920
#   dmx              0xd9b0
#   express          0xd930
#   express-mini     0xd940
#   fader            0xd9d0
#   fader-solo       0xd9f0
#   key-8            0xd9e0
#   key-9            0xd9c0
#   pad              0xd950
#   pulse            0xd960
#   range            0xd970
#   serial           0xd990
#   step             0xd9a0
#   itsybitsy        0xdf50
#
# Firmware:
#   glockenspiel-37  0xe910 (control)
#   express-drum     0xe920 (express-mini)
#   pedal            0xe930 (itsybitsy)
#   dmx              0xe940 (connect)
#   kontra-2         0xe950 (control)
#   kontra-2-string  0xe960 (step)
#   schlag-7         0xe970 (control)
#   schlag-7-stepper 0xe980 (step)
#   fader-keys       0xe990 (key-8)
#   attune           0xef20 (step)
#   pi-14537         0xef30 (control)


axis.name=axis
axis.vid.0=0x6666
axis.pid.0=0xd980
axis.build.vid=0x6666
axis.build.pid=0xd980
axis.build.mcu=cortex-m4
axis.build.f_cpu=120000000L
axis.build.cache_flags=-DENABLE_CACHE
axis.build.flags.optimize=-O3
axis.build.usb_product="axis"
axis.build.usb_manufacturer="Versio Duo"
axis.build.usb_power=20
axis.build.board=V2_AXIS
axis.build.core=arduino
axis.build.extra_flags=-D__SAMD51G19A__ -DV2_AXIS -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=12288
axis.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
axis.build.variant=axis
axis.build.variant_system_lib=
axis.upload.tool=bossac
axis.upload.protocol=sam-ba
axis.upload.maximum_size=245760
axis.upload.offset=0x4000
axis.upload.use_1200bps_touch=true
axis.upload.wait_for_upload_port=true
axis.upload.native_usb=true
axis.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

connect.name=connect
connect.vid.0=0x6666
connect.pid.0=0xd910
connect.build.vid=0x6666
connect.build.pid=0xd910
connect.build.mcu=cortex-m4
connect.build.f_cpu=120000000L
connect.build.cache_flags=-DENABLE_CACHE
connect.build.flags.optimize=-O3
connect.build.usb_product="connect"
connect.build.usb_manufacturer="Versio Duo"
connect.build.usb_power=20
connect.build.board=V2_CONNECT
connect.build.core=arduino
connect.build.extra_flags=-D__SAMD51G19A__ -DV2_CONNECT -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4  -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=12288
connect.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
connect.build.variant=connect
connect.build.variant_system_lib=
connect.upload.tool=bossac
connect.upload.protocol=sam-ba
connect.upload.maximum_size=245760
connect.upload.offset=0x4000
connect.upload.use_1200bps_touch=true
connect.upload.wait_for_upload_port=true
connect.upload.native_usb=true
connect.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

control.name=control
control.vid.0=0x6666
control.pid.0=0xd920
control.build.vid=0x6666
control.build.pid=0xd920
control.build.mcu=cortex-m4
control.build.f_cpu=120000000L
control.build.cache_flags=-DENABLE_CACHE
control.build.flags.optimize=-O3
control.build.usb_product="control"
control.build.usb_manufacturer="Versio Duo"
control.build.usb_power=20
control.build.board=V2_CONTROL
control.build.core=arduino
control.build.extra_flags=-D__SAMD51G19A__ -DV2_CONTROL -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4  -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=12288
control.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
control.build.variant=control
control.build.variant_system_lib=
control.upload.tool=bossac
control.upload.protocol=sam-ba
control.upload.maximum_size=245760
control.upload.offset=0x4000
control.upload.use_1200bps_touch=true
control.upload.wait_for_upload_port=true
control.upload.native_usb=true
control.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

dmx.name=dmx
dmx.vid.0=0x6666
dmx.pid.0=0xd9b0
dmx.build.vid=0x6666
dmx.build.pid=0xd9b0
dmx.build.mcu=cortex-m4
dmx.build.f_cpu=120000000L
dmx.build.cache_flags=-DENABLE_CACHE
dmx.build.flags.optimize=-O3
dmx.build.usb_product="dmx"
dmx.build.usb_manufacturer="Versio Duo"
dmx.build.usb_power=20
dmx.build.board=V2_DMX
dmx.build.core=arduino
dmx.build.extra_flags=-D__SAMD51G19A__ -DV2_DMX -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4  -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=12288
dmx.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
dmx.build.variant=dmx
dmx.build.variant_system_lib=
dmx.upload.tool=bossac
dmx.upload.protocol=sam-ba
dmx.upload.maximum_size=245760
dmx.upload.offset=0x4000
dmx.upload.use_1200bps_touch=true
dmx.upload.wait_for_upload_port=true
dmx.upload.native_usb=true
dmx.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

express.name=express
express.vid.0=0x6666
express.pid.0=0xd930
express.build.vid=0x6666
express.build.pid=0xd930
express.build.mcu=cortex-m4
express.build.f_cpu=120000000L
express.build.cache_flags=-DENABLE_CACHE
express.build.flags.optimize=-O3
express.build.usb_product="express"
express.build.usb_manufacturer="Versio Duo"
express.build.usb_power=20
express.build.board=V2_EXPRESS
express.build.core=arduino
express.build.extra_flags=-D__SAMD51J19A__ -DV2_EXPRESS -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4  -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=12288
express.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
express.build.variant=express
express.build.variant_system_lib=
express.upload.tool=bossac
express.upload.protocol=sam-ba
express.upload.maximum_size=245760
express.upload.offset=0x4000
express.upload.use_1200bps_touch=true
express.upload.wait_for_upload_port=true
express.upload.native_usb=true
express.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

express-mini.name=express-mini
express-mini.vid.0=0x6666
express-mini.pid.0=0xd940
express-mini.build.vid=0x6666
express-mini.build.pid=0xd940
express-mini.build.mcu=cortex-m4
express-mini.build.f_cpu=120000000L
express-mini.build.cache_flags=-DENABLE_CACHE
express-mini.build.flags.optimize=-O3
express-mini.build.usb_product="express-mini"
express-mini.build.usb_manufacturer="Versio Duo"
express-mini.build.usb_power=20
express-mini.build.board=V2_EXPRESS_MINI
express-mini.build.core=arduino
express-mini.build.extra_flags=-D__SAMD51G19A__ -DV2_EXPRESS_MINI -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4  -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=12288
express-mini.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
express-mini.build.variant=express-mini
express-mini.build.variant_system_lib=
express-mini.upload.tool=bossac
express-mini.upload.protocol=sam-ba
express-mini.upload.maximum_size=245760
express-mini.upload.offset=0x4000
express-mini.upload.use_1200bps_touch=true
express-mini.upload.wait_for_upload_port=true
express-mini.upload.native_usb=true
express-mini.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

fader.name=fader
fader.vid.0=0x6666
fader.pid.0=0xd9f0
fader.build.vid=0x6666
fader.build.pid=0xd9f0
fader.build.mcu=cortex-m4
fader.build.f_cpu=120000000L
fader.build.cache_flags=-DENABLE_CACHE
fader.build.flags.optimize=-O3
fader.build.usb_product="fader"
fader.build.usb_manufacturer="Versio Duo"
fader.build.usb_power=20
fader.build.board=V2_FADER
fader.build.core=arduino
fader.build.extra_flags=-D__SAMD51G19A__ -DV2_FADER -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4  -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=12288
fader.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
fader.build.variant=fader
fader.build.variant_system_lib=
fader.upload.tool=bossac
fader.upload.protocol=sam-ba
fader.upload.maximum_size=245760
fader.upload.offset=0x4000
fader.upload.use_1200bps_touch=true
fader.upload.wait_for_upload_port=true
fader.upload.native_usb=true
fader.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

fader-solo.name=fader-solo
fader-solo.vid.0=0x6666
fader-solo.pid.0=0xd9d0
fader-solo.build.vid=0x6666
fader-solo.build.pid=0xd9d0
fader-solo.build.mcu=cortex-m4
fader-solo.build.f_cpu=120000000L
fader-solo.build.cache_flags=-DENABLE_CACHE
fader-solo.build.flags.optimize=-O3
fader-solo.build.usb_product="fader-solo"
fader-solo.build.usb_manufacturer="Versio Duo"
fader-solo.build.usb_power=20
fader-solo.build.board=V2_FADER_SOLO
fader-solo.build.core=arduino
fader-solo.build.extra_flags=-D__SAMD51G19A__ -DV2_FADER_SOLO -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4  -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=12288
fader-solo.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
fader-solo.build.variant=fader-solo
fader-solo.build.variant_system_lib=
fader-solo.upload.tool=bossac
fader-solo.upload.protocol=sam-ba
fader-solo.upload.maximum_size=245760
fader-solo.upload.offset=0x4000
fader-solo.upload.use_1200bps_touch=true
fader-solo.upload.wait_for_upload_port=true
fader-solo.upload.native_usb=true
fader-solo.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

key-8.name=key-8
key-8.vid.0=0x6666
key-8.pid.0=0xd9e0
key-8.build.vid=0x6666
key-8.build.pid=0xd9e0
key-8.build.mcu=cortex-m4
key-8.build.f_cpu=120000000L
key-8.build.cache_flags=-DENABLE_CACHE
key-8.build.flags.optimize=-O3
key-8.build.usb_product="key-8"
key-8.build.usb_manufacturer="Versio Duo"
key-8.build.usb_power=20
key-8.build.board=V2_KEY_8
key-8.build.core=arduino
key-8.build.extra_flags=-D__SAMD51G19A__ -DV2_KEY_8 -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4  -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=12288
key-8.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
key-8.build.variant=key-8
key-8.build.variant_system_lib=
key-8.upload.tool=bossac
key-8.upload.protocol=sam-ba
key-8.upload.maximum_size=245760
key-8.upload.offset=0x4000
key-8.upload.use_1200bps_touch=true
key-8.upload.wait_for_upload_port=true
key-8.upload.native_usb=true
key-8.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

key-9.name=key-9
key-9.vid.0=0x6666
key-9.pid.0=0xd9c0
key-9.build.vid=0x6666
key-9.build.pid=0xd9c0
key-9.build.mcu=cortex-m4
key-9.build.f_cpu=120000000L
key-9.build.cache_flags=-DENABLE_CACHE
key-9.build.flags.optimize=-O3
key-9.build.usb_product="key-9"
key-9.build.usb_manufacturer="Versio Duo"
key-9.build.usb_power=20
key-9.build.board=V2_KEY_9
key-9.build.core=arduino
key-9.build.extra_flags=-D__SAMD51G19A__ -DV2_KEY_9 -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4  -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=12288
key-9.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
key-9.build.variant=key-9
key-9.build.variant_system_lib=
key-9.upload.tool=bossac
key-9.upload.protocol=sam-ba
key-9.upload.maximum_size=245760
key-9.upload.offset=0x4000
key-9.upload.use_1200bps_touch=true
key-9.upload.wait_for_upload_port=true
key-9.upload.native_usb=true
key-9.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

pad.name=pad
pad.vid.0=0x6666
pad.pid.0=0xd950
pad.build.vid=0x6666
pad.build.pid=0xd950
pad.build.mcu=cortex-m4
pad.build.f_cpu=120000000L
pad.build.cache_flags=-DENABLE_CACHE
pad.build.flags.optimize=-O3
pad.build.usb_product="pad"
pad.build.usb_manufacturer="Versio Duo"
pad.build.usb_power=20
pad.build.board=V2_PAD
pad.build.core=arduino
pad.build.extra_flags=-D__SAMD51G19A__ -DV2_PAD -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4  -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=12288
pad.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
pad.build.variant=pad
pad.build.variant_system_lib=
pad.upload.tool=bossac
pad.upload.protocol=sam-ba
pad.upload.maximum_size=245760
pad.upload.offset=0x4000
pad.upload.use_1200bps_touch=true
pad.upload.wait_for_upload_port=true
pad.upload.native_usb=true
pad.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

