versioduo/arduino-board-package/boards.txt
pulse.name=pulse
pulse.vid.0=0x6666
pulse.pid.0=0xd960
pulse.build.vid=0x6666
pulse.build.pid=0xd960
pulse.build.mcu=cortex-m4
pulse.build.f_cpu=120000000L
pulse.build.cache_flags=-DENABLE_CACHE
pulse.build.flags.optimize=-O3
pulse.build.usb_product="pulse"
pulse.build.usb_manufacturer="Versio Duo"
pulse.build.usb_power=20
pulse.build.board=V2_PULSE
pulse.build.core=arduino
pulse.build.extra_flags=-D__SAMD51J19A__ -DV2_PULSE -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4  -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=12288
pulse.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
pulse.build.variant=pulse
pulse.build.variant_system_lib=
pulse.upload.tool=bossac
pulse.upload.protocol=sam-ba
pulse.upload.maximum_size=245760
pulse.upload.offset=0x4000
pulse.upload.use_1200bps_touch=true
pulse.upload.wait_for_upload_port=true
pulse.upload.native_usb=true
pulse.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

range.name=range
range.vid.0=0x6666
range.pid.0=0xd970
range.build.vid=0x6666
range.build.pid=0xd970
range.build.mcu=cortex-m4
range.build.f_cpu=120000000L
range.build.cache_flags=-DENABLE_CACHE
range.build.flags.optimize=-O3
range.build.usb_product="range"
range.build.usb_manufacturer="Versio Duo"
range.build.usb_power=20
range.build.board=V2_RANGE
range.build.core=arduino
range.build.extra_flags=-D__SAMD51G19A__ -DV2_RANGE -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=12288
range.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
range.build.variant=range
range.build.variant_system_lib=
range.upload.tool=bossac
range.upload.protocol=sam-ba
range.upload.maximum_size=245760
range.upload.offset=0x4000
range.upload.use_1200bps_touch=true
range.upload.wait_for_upload_port=true
range.upload.native_usb=true
range.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

serial.name=serial
serial.vid.0=0x6666
serial.pid.0=0xd990
serial.build.vid=0x6666
serial.build.pid=0xd990
serial.build.mcu=cortex-m4
serial.build.f_cpu=120000000L
serial.build.cache_flags=-DENABLE_CACHE
serial.build.flags.optimize=-O3
serial.build.usb_product="serial"
serial.build.usb_manufacturer="Versio Duo"
serial.build.usb_power=20
serial.build.board=V2_SERIAL
serial.build.core=arduino
serial.build.extra_flags=-D__SAMD51G19A__ -DV2_SERIAL -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=12288
serial.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
serial.build.variant=serial
serial.build.variant_system_lib=
serial.upload.tool=bossac
serial.upload.protocol=sam-ba
serial.upload.maximum_size=245760
serial.upload.offset=0x4000
serial.upload.use_1200bps_touch=true
serial.upload.wait_for_upload_port=true
serial.upload.native_usb=true
serial.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

step.name=step
step.vid.0=0x6666
step.pid.0=0xd9a0
step.build.vid=0x6666
step.build.pid=0xd9a0
step.build.mcu=cortex-m4
step.build.f_cpu=120000000L
step.build.cache_flags=-DENABLE_CACHE
step.build.flags.optimize=-O3
step.build.usb_product="step"
step.build.usb_manufacturer="Versio Duo"
step.build.usb_power=20
step.build.board=V2_STEP
step.build.core=arduino
step.build.extra_flags=-D__SAMD51J19A__ -DV2_STEP -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=12288
step.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
step.build.variant=step
step.build.variant_system_lib=
step.upload.tool=bossac
step.upload.protocol=sam-ba
step.upload.maximum_size=245760
step.upload.offset=0x4000
step.upload.use_1200bps_touch=true
step.upload.wait_for_upload_port=true
step.upload.native_usb=true
step.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

itsybitsy.name=itsybitsy
itsybitsy.vid.0=0x6666
itsybitsy.pid.0=0xdf50
itsybitsy.build.vid=0x6666
itsybitsy.build.pid=0xdf50
itsybitsy.build.mcu=cortex-m4
itsybitsy.build.f_cpu=120000000L
itsybitsy.build.cache_flags=-DENABLE_CACHE
itsybitsy.build.flags.optimize=-O3
itsybitsy.build.usb_product="itsybitsy"
itsybitsy.build.usb_manufacturer="Versio Duo"
itsybitsy.build.usb_power=20
itsybitsy.build.board=V2_ITSYBITSY
itsybitsy.build.core=arduino
itsybitsy.build.extra_flags=-D__SAMD51G19A__ -DV2_ITSYBITSY -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -DCRYSTALLESS -mfloat-abi=hard -mfpu=fpv4-sp-d16
itsybitsy.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
itsybitsy.build.variant=itsybitsy
itsybitsy.build.variant_system_lib=
itsybitsy.upload.tool=bossac
itsybitsy.upload.protocol=sam-ba
itsybitsy.upload.maximum_size=245760
itsybitsy.upload.offset=0x4000
itsybitsy.upload.use_1200bps_touch=true
itsybitsy.upload.wait_for_upload_port=true
itsybitsy.upload.native_usb=true
itsybitsy.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
